# === Фрагмент А ===
# Ожидаемый результат: сумма чисел (5)
first = "2"
second = "3"

# Преобразование типов str -> int
first_num = int(first)
second_num = int(second)

print("Фрагмент А (Было изначально):", first + second)
print("Фрагмент А (Сумма чисел):", first_num + second_num)


# === Фрагмент Б ===
# Ожидаемый результат: возраст через год (для ввода 17 вывод должен быть 18)
age_str = input("Возраст: ")  # Ввод пользователя (тип str)

# Преобразование типа str -> int
age_num = int(age_str)

print("Фрагмент Б (Было изначально):", 'age_str + 1 - вывело бы ошибку, т. к. нельзя складывать строки и числа')
print("Фрагмент Б (Возраст через год):", age_num + 1)


# === Фрагмент В ===
# Ожидаемый результат: среднее значение (7.0)
first = 4
second = 7
third = 10

# Добавлены скобки для изменения приоритета операций
average = (first + second + third) / 3

print("Фрагмент В (Среднее трех чисел):", average)